Infineon/mtb-example-psoc-edge-btstack-cts-client/proj_cm33_ns/cts_client.c
/******************************************************************************
 * File Name: ctc_client.c
 *
 * Description: This file contains the Bluetooth LE stack event handler, button
 *              interrupt handler and button task. Advertisement is started on
 *              button press, service discovery happens after connection and
 *              notifications from the server are enabled/disabled using button
 *              press.
 *
 * Related Document: See README.md
 *
 *******************************************************************************
 * Copyright 2024-2025, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 *******************************************************************************/

/*******************************************************************************
 *        Header Files
 *******************************************************************************/
 #include "wiced_bt_stack.h"
 #include "cybsp.h"
 #include "cy_retarget_io.h"
 #include <FreeRTOS.h>
 #include <task.h>
 #include <queue.h>
 #include "cycfg_gatt_db.h"
 #include "cycfg_bt_settings.h"
 #include "cycfg_gap.h"
 #include "wiced_bt_dev.h"
 #include "app_bt_utils.h"
 #include "cts_client.h"
 #include <stdlib.h>
 #include "wiced_bt_uuid.h"
 #include "wiced_bt_types.h"
 
 /*******************************************************************************
  *        Variable Definitions
  *******************************************************************************/
 static uint16_t                    bt_connection_id = 0;
 static current_time_data_t         time_date_notif;
 static cts_discovery_data_t        cts_discovery_data;
 static bool                        notify_val = false;
 static bool                        button_press_for_adv = true;
 
 /* Array to hold strings for names of days of the week */
 const char* day_of_week_str[]=
 {
         "UNKNOWN",
         "SUNDAY",
         "MONDAY",
         "TUESDAY",
         "WEDNESDAY",
         "THURSDAY",
         "FRIDAY",
         "SATURDAY"
 };
 
 /*******************************************************************************
  * Macros
  *******************************************************************************/
 
 #define CONST_ZERO                      (0U)
 #define SCAN_RESPONSE_NO_OF_ELEMENTS    (1U) 
 #define DELAY_10_MS                     (10U)
 #define START_HANDLE                    (0x01)
 #define END_HANDLE                      (0xFFFF)
 #define DELAY_MS                        (100U)
 
 #define GPIO_INTERRUPT_PRIORITY         (7U)
 /*******************************************************************************
  *        Function Prototypes
  *******************************************************************************/
 static void ble_app_init(void);
 static void print_notification_data(wiced_bt_gatt_data_t notif_data);
 const  char* get_day_of_week(uint8_t day);
 static wiced_bt_gatt_status_t ble_app_write_notification_cccd(bool notify);
 
 /* GATT Event Callback Functions */
 static wiced_bt_gatt_status_t ble_app_connect_handler(wiced_bt_gatt_connection_status_t *p_conn_status);
 static wiced_bt_gatt_status_t ble_app_gatt_event_callback(wiced_bt_gatt_evt_t  event,
         wiced_bt_gatt_event_data_t *p_event_data);
 static wiced_bt_gatt_status_t  ble_app_service_discovery_handler(wiced_bt_gatt_discovery_complete_t *discovery_complete);
 static wiced_bt_gatt_status_t  ble_app_discovery_result_handler(wiced_bt_gatt_discovery_result_t *discovery_result);
 wiced_bt_dev_status_t wiced_bt_ble_set_raw_scan_response_data(uint8_t num_elem, wiced_bt_ble_advert_elem_t *p_data);
 
  /* Interrupt config structure */
  cy_stc_sysint_t intrCfg =
  {
          CYBSP_USER_BTN_IRQ,       /* Interrupt source */
          GPIO_INTERRUPT_PRIORITY   /* Interrupt priority */
  };
  
 /*******************************************************************************
  * Function Name: app_bt_management_callback()
  ********************************************************************************
  * Summary:
  *   This is a Bluetooth stack event handler function to receive management
  *   events from the Bluetooth LE stack and process as per the application.
  *
  * Parameters:
  *   wiced_bt_management_evt_t event : Bluetooth LE event code of one byte length
  *   wiced_bt_management_evt_data_t *p_event_data: Pointer to Bluetooth LE
  *                                                 management event structures
  *
  * Return:
  *  wiced_result_t: Error code from WICED_RESULT_LIST or BT_RESULT_LIST
  *
  *******************************************************************************/
 wiced_result_t app_bt_management_callback(wiced_bt_management_evt_t event,
         wiced_bt_management_evt_data_t *p_event_data)
 {
     wiced_result_t wiced_result = WICED_BT_SUCCESS;
     wiced_bt_device_address_t bda = { 0 };
     wiced_bt_ble_advert_mode_t *p_adv_mode = NULL;
 
