Infineon/mtb-example-psoc-edge-btstack-cts-client/proj_cm33_ns/cts_client.c
     switch (event)
     {
     case BTM_ENABLED_EVT:
 
         /* Bluetooth Controller and Host Stack Enabled */
         if (WICED_BT_SUCCESS == p_event_data->enabled.status)
         {
             wiced_bt_dev_read_local_addr(bda);
             printf("Local Bluetooth Address: ");
             print_bd_address(bda);
 
             /* Perform application-specific initialization */
             ble_app_init();
         }
         else
         {
             printf( "Bluetooth Disabled \n" );
         }
 
         break;
 
     case BTM_BLE_ADVERT_STATE_CHANGED_EVT:
 
         /* Advertisement State Changed */
         p_adv_mode = &p_event_data->ble_advert_state_changed;
         printf("Advertisement State Change: %s\n",
                 get_bt_advert_mode_name(*p_adv_mode));
 
         if (BTM_BLE_ADVERT_OFF == *p_adv_mode)
         {
             /* Advertisement Stopped */
             printf("Advertisement stopped\n");
         }
         else
         {
             /* Advertisement Started */
             printf("Advertisement started\n");
         }
         break;
 
     case BTM_BLE_CONNECTION_PARAM_UPDATE:
         printf("Connection parameter update status:%d, Connection Interval: %d,"
                 " Connection Latency: %d, Connection Timeout: %d\n",
                 p_event_data->ble_connection_param_update.status,
                 p_event_data->ble_connection_param_update.conn_interval,
                 p_event_data->ble_connection_param_update.conn_latency,
                 p_event_data->ble_connection_param_update.supervision_timeout);
         break;
     }
 
     return wiced_result;
 }
 /*******************************************************************************
  * Function Name: ble_app_init()
  ********************************************************************************
  * Summary:
  *   This function handles application level initialization tasks and is called
  *   from the BT management callback once the Bluetooth LE stack enabled event
  *   (BTM_ENABLED_EVT) is triggered. This function is executed in the
  *   BTM_ENABLED_EVT management callback.
  *
  * Parameters:
  *   None
  *
  * Return:
  *   None
  *
  *******************************************************************************/
 static void ble_app_init(void)
 {
     wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_SUCCESS;
 
     Cy_GPIO_ClearInterrupt(CYBSP_USER_BTN_PORT, CYBSP_USER_BTN_PIN);
     Cy_GPIO_ClearInterrupt(CYBSP_USER_BTN2_PORT, CYBSP_USER_BTN2_PIN);
     NVIC_ClearPendingIRQ(CYBSP_USER_BTN1_IRQ);
 
     /* Initialize the interrupt and register interrupt callback */
     Cy_SysInt_Init(&intrCfg, &button_interrupt_handler);
     /* Enable the interrupt in the NVIC */
     NVIC_EnableIRQ(intrCfg.intrSrc);
 
     /* Set Advertisement Data */
     wiced_bt_ble_set_raw_advertisement_data(CY_BT_ADV_PACKET_DATA_SIZE,
             cy_bt_adv_packet_data);
     wiced_bt_ble_set_raw_scan_response_data (SCAN_RESPONSE_NO_OF_ELEMENTS,
             cy_bt_scan_resp_packet_data);
 
     /* Register with BT stack to receive GATT callback */
     gatt_status = wiced_bt_gatt_register(ble_app_gatt_event_callback);
     printf("GATT event Handler registration status: %s \n",
             get_bt_gatt_status_name(gatt_status));
 
     /* Initialize GATT Database */
     gatt_status = wiced_bt_gatt_db_init(gatt_database, gatt_database_len, NULL);
     printf("GATT database initialization status: %s \n",
             get_bt_gatt_status_name(gatt_status));
     printf("Press User button to start advertising.....\n");
 }
 
 /*******************************************************************************
  * Function Name: button_interrupt_handler
  ********************************************************************************
  *
  * Summary:
  *   This interrupt handler enables or disables GATT notifications upon button
  *   press.
  * 
  * Parameters:
  *   void
  * 
  * Return:
  *   void
  *
  *******************************************************************************/
 void button_interrupt_handler(void)
 {
     /* Clear the interrupt */
     Cy_GPIO_ClearInterrupt(CYBSP_USER_BTN_PORT, CYBSP_USER_BTN_PIN);
 
     BaseType_t xHigherPriorityTaskWoken;
     xHigherPriorityTaskWoken = pdFALSE;
     vTaskNotifyGiveFromISR(button_task_handle, &xHigherPriorityTaskWoken);
     portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
 
 }
 
 /*******************************************************************************
  * Function Name: button_task()
  ********************************************************************************
  *
  * Summary:
  *   This task starts Bluetooth LE advertisment on first button press and enables
  *   or disables notifications from the server upon successive button presses.
  *
  * Parameters:
  *   void *pvParameters:                Not used
  *
  * Return:
  *   None
  *
  *******************************************************************************/
 void button_task(void *pvParameters)
 {
     wiced_result_t wiced_result = WICED_BT_ERROR;
     wiced_bt_gatt_status_t gatt_status;
     for(;;)
     {
         ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
         if(button_press_for_adv)
         {
             wiced_result = wiced_bt_start_advertisements(BTM_BLE_ADVERT_UNDIRECTED_HIGH,
                     CONST_ZERO, NULL);
             /* Failed to start advertisement, inform user */
             if (WICED_BT_SUCCESS != wiced_result)
             {
                 printf("Failed to start advertisement! Error code: %X \n",
                         wiced_result);
             }
         }
         else
         {
             if((cts_discovery_data.cts_service_found == true) && (bt_connection_id != CONST_ZERO))
             {
                 /* Toggle the flag to enable/disable CCCD based on previous state */
                 notify_val = !notify_val;
                 gatt_status = ble_app_write_notification_cccd(notify_val);
                 if(WICED_BT_GATT_SUCCESS != gatt_status)
                 {
                     Cy_SysLib_Delay(DELAY_MS);
                     printf("Enable/Disable notification failed! Error code: %X \n"
                             ,gatt_status);
                 }
             }
         }
     }
 }
 
