Infineon/mtb-example-psoc-edge-btstack-cts-client/proj_cm33_ns/cts_client.c
 /*******************************************************************************
  * Function Name: ble_app_gatt_event_callback()
  ********************************************************************************
  * Summary:
  *   GATT Callback function registered with Bluetooth stack to handle GATT events.
  *
  * Parameters:
  *   wiced_bt_gatt_evt_t event : Bluetooth LE GATT event code of one byte length
  *   wiced_bt_gatt_event_data_t *p_event_data : Pointer to Bluetooth LE GATT
  *                                              event structures
  * Return:
  *  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
  *                          in wiced_bt_gatt.h
  *******************************************************************************/
 static wiced_bt_gatt_status_t
 ble_app_gatt_event_callback(wiced_bt_gatt_evt_t event,
         wiced_bt_gatt_event_data_t *p_event_data)
 {
     wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_SUCCESS;
 
     /* Call the appropriate callback function based on the GATT event type, and
      * pass the relevant event parameters to the callback function */
     switch ( event )
     {
     case GATT_CONNECTION_STATUS_EVT:
         gatt_status = ble_app_connect_handler(&p_event_data->connection_status);
         break;
 
     case GATT_DISCOVERY_RESULT_EVT:
         gatt_status = ble_app_discovery_result_handler(&p_event_data->discovery_result);
         break;
 
     case GATT_DISCOVERY_CPLT_EVT:
         gatt_status = ble_app_service_discovery_handler(&p_event_data->discovery_complete);
         break;
 
     case GATT_OPERATION_CPLT_EVT:
         switch (p_event_data->operation_complete.op)
         {
         case GATTC_OPTYPE_WRITE_WITH_RSP:
             /* Check if GATT operation of enable/disable notification is success. */
             if ((p_event_data->operation_complete.response_data.handle
                     == (cts_discovery_data.cts_cccd_handle))
                     && (WICED_BT_GATT_SUCCESS == p_event_data->operation_complete.status))
             {
                 if(notify_val)
                 {
                     printf("Notifications enabled\n");
                 }
                 else
                 {
                     printf("Notifications disabled\n");
                 }
             }
             else
             {
                 printf("CCCD update failed. Error code: %d\n",
                         p_event_data->operation_complete.status);
             }
             break;
 
         case GATTC_OPTYPE_NOTIFICATION:
             /* Function call to print the time and date notifcation */
             print_notification_data(p_event_data->operation_complete.response_data.att_value);
             break;
         }
         break;
 
         case GATT_APP_BUFFER_TRANSMITTED_EVT:
         {
             vPortFree(p_event_data->buffer_xmitted.p_app_data);
             break;
         }
 
         default:
             gatt_status = WICED_BT_GATT_SUCCESS;
             break;
     }
 
     return gatt_status;
 }
 
 /*******************************************************************************
  * Function Name:  ble_app_connect_handler()
  ********************************************************************************
  * Summary:
  *   This function handles connection status changes.
  *
  * Parameters:
  *   wiced_bt_gatt_connection_status_t *p_conn_status : Pointer to data that has
  *                                                      connection details
  *
  * Return:
  *  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
  *                          in wiced_bt_gatt.h
  *
  *******************************************************************************/
 static wiced_bt_gatt_status_t
 ble_app_connect_handler(wiced_bt_gatt_connection_status_t *p_conn_status)
 {
     wiced_bt_gatt_status_t gatt_status =  WICED_BT_GATT_SUCCESS;
     wiced_bt_gatt_discovery_param_t service_discovery_setup = {0};

     if ( NULL != p_conn_status )
     {
         if ( p_conn_status->connected )
         {
             /* Device has connected */
             printf("Connected : BDA " );
             print_bd_address(p_conn_status->bd_addr);
             printf("Connection ID '%d' \n", p_conn_status->conn_id );

             /* Store the connection ID */
             bt_connection_id = p_conn_status->conn_id;
             /* After connection, successive button presses must enable/disable
             notification from server */
             button_press_for_adv = false;

             /* Send GATT service discovery request */
             service_discovery_setup.s_handle = START_HANDLE;
             service_discovery_setup.e_handle = END_HANDLE;
             service_discovery_setup.uuid.len = LEN_UUID_16;
             service_discovery_setup.uuid.uu.uuid16 = UUID_SERVICE_CURRENT_TIME;

             gatt_status = wiced_bt_gatt_client_send_discover(bt_connection_id,
                     GATT_DISCOVER_SERVICES_BY_UUID,
                     &service_discovery_setup);
             if(WICED_BT_GATT_SUCCESS != gatt_status)
             {
                 printf("GATT Discovery request failed. Error code: %d, "
                         "Conn id: %d\n", gatt_status, bt_connection_id);
             }
             else
             {
                 printf("Service Discovery Started\n");
             }
         }
         else
         {
             /* Device has disconnected */
             printf("Disconnected : BDA " );
             print_bd_address(p_conn_status->bd_addr);
             printf("Connection ID '%d', Reason '%s'\n", p_conn_status->conn_id,
                     get_bt_gatt_disconn_reason_name(p_conn_status->reason) );

             /* Set the connection id to zero to indicate disconnected state */
             bt_connection_id = CONST_ZERO;

             /* Service discovery is performed upon reconnection, so reset the
              * status of service found flag */
             cts_discovery_data.cts_service_found = false;
             /* First button press after disconnection must start advertisement */
             button_press_for_adv = true;
         }
     }
     else
     {
         gatt_status = WICED_BT_GATT_ERROR;
     }
     return gatt_status;
 }
 
 /********************************************************************************
  * Function Name:  ble_app_discovery_result_handler()
  *********************************************************************************
  * Summary:
  *   This function handles discovery results from bluetooth stack.
  *
  * Parameters:
  *   wiced_bt_gatt_discovery_result_t *discovery_result : Pointer to data
  *   that has discovery details.
  *
  * Return:
  *  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
  *                          in wiced_bt_gatt.h
  *
  *********************************************************************************/
 static wiced_bt_gatt_status_t
 ble_app_discovery_result_handler(wiced_bt_gatt_discovery_result_t *discovery_result)
 {
     wiced_bt_gatt_status_t gatt_status =  WICED_BT_GATT_SUCCESS;
     wiced_bt_gatt_discovery_type_t discovery_type;
     discovery_type = discovery_result->discovery_type;
     switch (discovery_type)
     {
     case GATT_DISCOVER_SERVICES_BY_UUID:
         if(UUID_SERVICE_CURRENT_TIME ==
                 discovery_result->discovery_data.group_value.service_type.uu.uuid16)
         {
             cts_discovery_data.cts_start_handle = discovery_result->discovery_data.group_value.s_handle;
             cts_discovery_data.cts_end_handle = discovery_result->discovery_data.group_value.e_handle;
             printf("CTS Service Found, Start Handle = %d, End Handle = %d \n",
                     cts_discovery_data.cts_start_handle,
                     cts_discovery_data.cts_end_handle);
         }
         break;
 
