Infineon/mtb-example-psoc-edge-btstack-cts-client/proj_cm33_ns/cts_client.c
     case GATT_DISCOVER_CHARACTERISTICS:
         if(UUID_CHARACTERISTIC_CURRENT_TIME ==
                 discovery_result->discovery_data.characteristic_declaration.char_uuid.uu.uuid16)
         {
             cts_discovery_data.cts_char_handle = discovery_result->discovery_data.characteristic_declaration.handle;
             cts_discovery_data.cts_char_val_handle = discovery_result->discovery_data.characteristic_declaration.val_handle;
             printf("Current Time characteristic handle = %d, "
                     "Current Time characteristic value handle = %d\n",
                     cts_discovery_data.cts_char_handle,
                     cts_discovery_data.cts_char_val_handle);
         }
         break;
 
     case GATT_DISCOVER_CHARACTERISTIC_DESCRIPTORS:
         if(UUID_DESCRIPTOR_CLIENT_CHARACTERISTIC_CONFIGURATION ==
                 discovery_result->discovery_data.char_descr_info.type.uu.uuid16)
         {
             cts_discovery_data.cts_cccd_handle = discovery_result->discovery_data.char_descr_info.handle;
             cts_discovery_data.cts_service_found = true;
             printf("Current Time CCCD found, Handle = %d\n",
                     cts_discovery_data.cts_cccd_handle);
             printf("Press User button on the kit to enable or disable "
                     "notifications \n");
         }
         break;
 
     default:
         break;
     }
 
     return gatt_status;
 }
 
 /********************************************************************************
  * Function Name:  ble_app_service_discovery_handler()
  *********************************************************************************
  * Summary:
  *   This function handles service discovery for CTS.
  *
  * Parameters:
  *   wiced_bt_gatt_discovery_complete_t *discovery_complete : Pointer to data
  *   that has type and status of the completed discovery.
  *
  * Return:
  *  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
  *                          in wiced_bt_gatt.h
  *
  *********************************************************************************/
 static wiced_bt_gatt_status_t
 ble_app_service_discovery_handler(wiced_bt_gatt_discovery_complete_t *discovery_complete)
 {
     wiced_bt_gatt_status_t gatt_status =  WICED_BT_GATT_SUCCESS;
     wiced_bt_gatt_discovery_param_t char_discovery_setup = {0};
     wiced_bt_gatt_discovery_type_t discovery_type;
     discovery_type = discovery_complete->discovery_type;
     switch (discovery_type)
     {
     case GATT_DISCOVER_SERVICES_BY_UUID:
     {
         char_discovery_setup.s_handle = cts_discovery_data.cts_start_handle;
         char_discovery_setup.e_handle = cts_discovery_data.cts_end_handle;
         char_discovery_setup.uuid.uu.uuid16 = UUID_CHARACTERISTIC_CURRENT_TIME;
         gatt_status = wiced_bt_gatt_client_send_discover(bt_connection_id,
                 GATT_DISCOVER_CHARACTERISTICS,
                 &char_discovery_setup);
         if(WICED_BT_GATT_SUCCESS != gatt_status)
             printf("GATT characteristics discovery failed! Error code = %d\n", gatt_status);
         break;
     }
 
     case GATT_DISCOVER_CHARACTERISTICS:
     {
         char_discovery_setup.s_handle = cts_discovery_data.cts_start_handle;
         char_discovery_setup.e_handle = cts_discovery_data.cts_end_handle;
         char_discovery_setup.uuid.uu.uuid16 = UUID_CHARACTERISTIC_CURRENT_TIME;
         gatt_status = wiced_bt_gatt_client_send_discover(bt_connection_id,
                 GATT_DISCOVER_CHARACTERISTIC_DESCRIPTORS,
                 &char_discovery_setup);
 
         if(WICED_BT_GATT_SUCCESS != gatt_status)
             printf("GATT CCCD discovery failed! Error code = %d\n", gatt_status);
         break;
     }
 
     default:
         break;
     }
     return gatt_status;
 }
 
 /*******************************************************************************
  * Function Name: ble_app_write_notification_cccd()
  ********************************************************************************
  * Summary:
  *   Enable/Disable GATT notification from the server.
  *
  * Parameters:
  *   bool notify : true - to enable notifications
  *                 false - to disable notifications
  *
  * Return:
  *   wiced_bt_gatt_status_t  : Status code from wiced_bt_gatt_status_e.
  *
  *******************************************************************************/
 static wiced_bt_gatt_status_t ble_app_write_notification_cccd(bool notify)
 {
     wiced_bt_gatt_write_hdr_t  write_hdr = {0};
     wiced_bt_gatt_status_t     gatt_status = WICED_BT_GATT_SUCCESS;
     uint8_t * notif_val = NULL;
 
     /* Allocate memory for data to be written on server DB and pass it to stack*/
     notif_val = pvPortMalloc(sizeof(uint16_t)); //CCCD is two bytes
     if (notif_val)
     {
         notif_val[0] = notify;
         notif_val[1] = CONST_ZERO;
         write_hdr.auth_req = GATT_AUTH_REQ_NONE;
         write_hdr.handle = cts_discovery_data.cts_cccd_handle;
         write_hdr.len      = LEN_UUID_16;
         write_hdr.offset = CONST_ZERO;
         gatt_status = wiced_bt_gatt_client_send_write(bt_connection_id,
                 GATT_REQ_WRITE,
                 &write_hdr,
                 notif_val,
                 NULL);
     }
     return gatt_status;
 }
 
 /*******************************************************************************
  * Function Name: print_notification_data()
  ********************************************************************************
  * Summary:
  *   Parses the notification data to get date, time and other fields.
  *
  * Parameters:
  *   wiced_bt_gatt_data_t notif_data: Notification packet from GATT server
  *
  * Return:
  *   None
  *
  *******************************************************************************/
 static void print_notification_data(wiced_bt_gatt_data_t notif_data)
 {
     time_date_notif.year          = (notif_data.p_data[1] << 8u) | notif_data.p_data[0];
     time_date_notif.month         = notif_data.p_data[2];
     time_date_notif.day           = notif_data.p_data[3];
     time_date_notif.hours         = notif_data.p_data[4];
     time_date_notif.minutes       = notif_data.p_data[5];
     time_date_notif.seconds       = notif_data.p_data[6];
     time_date_notif.day_of_week   = notif_data.p_data[7];
     time_date_notif.fractions_256 = notif_data.p_data[8];
     time_date_notif.adjust_reason = notif_data.p_data[9];
 
     if(time_date_notif.adjust_reason)
     {
         if((time_date_notif.adjust_reason & MANUAL_TIME_UPDATE) ==
                 MANUAL_TIME_UPDATE)
         {
             printf("Time Adjust Reason: Manual Time Update\n");
         }
         if((time_date_notif.adjust_reason & EXTERNAL_REFERENCE_TIME_UPDATE) ==
                 EXTERNAL_REFERENCE_TIME_UPDATE)
         {
             printf("Time Adjust Reason: External Reference Time Update\n");
         }
         if((time_date_notif.adjust_reason & CHANGE_OF_TIME_ZONE) ==
                 CHANGE_OF_TIME_ZONE)
         {
             printf("Time Adjust Reason: Change of Time Zone\n");
         }
         if((time_date_notif.adjust_reason & CHANGE_OF_DST) == CHANGE_OF_DST)
         {
             printf("Time Adjust Reason: Change of DST\n");
         }
     }
 
     printf("Date (dd-mm-yyyy): %d - %d - %d \n", time_date_notif.day,
             time_date_notif.month,
             time_date_notif.year);
     printf("Time (HH:MM:SS): %d:%d:%d \n", time_date_notif.hours,
             time_date_notif.minutes,
             time_date_notif.seconds);
     printf("Day of the week = %s\n\n", get_day_of_week(time_date_notif.day_of_week));
 }
 
 /*******************************************************************************
  * Function Name: get_day_of_week()
  ********************************************************************************
  * Summary: Parse day of week code to string
  *
  * Parameters:
  *   uint8_t day: code for day of the week
  *
  * Return:
  *   const char*: Pointer to day of week string
  *
  *******************************************************************************/
 const char* get_day_of_week(uint8_t day)
 {
     if (day >= sizeof(day_of_week_str) / sizeof(char*))
     {
         return "** UNKNOWN **";
     }

     return day_of_week_str[day];
 }
 
